lesson5/app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save
---
INSERT INTO "appointments" ("physician_id", "patient_id", "appointment_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["physician_id", 2], ["patient_id", 4], ["appointment_date", "2021-12-28 15:29:00"], ["created_at", "2021-12-27 13:30:00.858477"], ["updated_at", "2021-12-27 13:30:00.858477"]]

  def show
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @appointment = Appointment.new
    @patients = Patient.all
    @physicians = Physician.all
---
SELECT "physicians".* FROM "physicians"

  def edit
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @appointment = Appointment.find(params[:id])
    if @appointment.update(appointment_params)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "appointments" SET "appointment_date" = $1, "updated_at" = $2 WHERE "appointments"."id" = $3  [["appointment_date", "2021-12-31 21:12:00"], ["updated_at", "2021-12-27 13:29:05.720695"], ["id", 1]]

  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 7]]