lesson5/app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT "patients".* FROM "patients"

  def show
    @patient = Patient.find(params[:id])
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @patient = Patient.new(patient_params)
    if @patient.save
---
INSERT INTO "patients" ("first_name", "created_at", "updated_at", "last_name", "age", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Arsenii"], ["created_at", "2021-12-27 14:42:38.129143"], ["updated_at", "2021-12-27 14:42:38.129143"], ["last_name", "Iurkov"], ["age", 20], ["email", "denver@test.test"]]