lesson5/app/controllers/physicians_controller.rb

SELECT "physicians".* FROM "physicians"
---
  def index
    @physicians = Physician.all

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @physician = Physician.find(params[:id])

INSERT INTO "physicians" ("first_name", "created_at", "updated_at", "last_name", "phone", "level") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "NotArs"], ["created_at", "2021-12-27 14:43:14.284336"], ["updated_at", "2021-12-27 14:43:14.284336"], ["last_name", "NotIurkov"], ["phone", "+380951031932"], ["level", "junior"]]
---
  def create
    @physician = Physician.new(physician_params)
    if @physician.save

SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @physician = Physician.find(params[:id])