lesson5/app/views/appointments/_card.html.erb

  <div class ="card-body">
    <p><b>Patient: </b><%= appointment.patient.first_name%></p>
    <p><b>Physician: </b><%= appointment.physician.first_name%></p>
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "physicians".* FROM "physicians" WHERE "physicians"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]